[
{
    "name": "Immanuel Whang",
    "title": "President",
    "photoURL": "https://i.ibb.co/Ldf3QXn/yb-picture-Immanuel-Whang.png",
    "bio": "After taking his first AMC 8 in 4th grade, Immanuel fell in love with problem solving and never looked back. Since then, some of his mathematical experiences include taking the USAJMO, attending PROMYS, and competing at HMMT. In his free time, Immanuel enjoys listening to music and going on walks."
},
{
    "name": "Amy Cui",
    "title": "Vice-President",
    "photoURL": "assets/images/slg-photos/Amy-Cropped.jpg",
    "bio": "Amy is a senior at Lakeside School. She began participating in math competitions in elementary school and has since attended MOP twice, won a gold medal in the Math Prize Olympiad, won a bronze medal in the AMO, and was a top winner in the JMO. Her favorite subject in math is geometry. Outside of math, she is a competitive runner in track and cross country, and she enjoys spending time with friends, listening to music, and trying new foods."
},
{
    "name": "Owen Xuan",
    "title": "Elementary Competition Director, Webmaster",
    "photoURL": "[update]",
    "bio": "Owen is a senior at Lakeside School. He likes applied math (poker) and game theory. If he's not teaching elementary schoolers math over the summer, or drinking chocolate milk after a cross country meet, don't hesitate to ask to duo on bughouse or go bouldering. He's qualified for the USAJMO 2x, AIME 5x, and his favorite math experience has been, unequivocally, HCSSiM."
},
  {
    "name": "Christina Liu",
    "title": "Outreach Director, Webmaster",
    "photoURL": "https://files.catbox.moe/lragml.png",
    "bio": "Christina is a senior at Lakeside School. She is a USAMO and USAJMO qualifier, has qualified for the AIME five times, been on the AMC 10/12 Distinguished Honor Roll three times, and is a Canada/USA Mathcamp and HCSSiM alum. Outside of math, she enjoys any kind of board sport (snowboarding, skateboarding, wakeboarding, surfing, probably fireboarding if it existed), playing cello and electric guitar, and annihilating people at volleyball. Here’s a lame fact about her: if she was born three hours later, she would be four years old!"
},
{
    "name": "Jai Bindlish",
    "title": "Web Outreach Director, Webmaster",
    "photoURL": "https://i.ibb.co/XjfBNRR/1501782.png",
    "bio": "Jai is a junior at Tesla STEM High School. He started his math journey in 4th grade, with the AMC8. Since then, he has participated in many math excursions, like SMT, AIME, BMT, and ARML. When he's not doing math, you can find him playing football, teaching TaeKwonDo as a 2nd degree black belt, and messing with Arduinos and other microcontrollers."
},
{
    "name": "Christopher Peng",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "Erin Bian",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "Max Xie",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "Sophia Shen",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "Benjamin",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "Raymond Zhu",
    "title": "",
    "photoURL": "",
    "bio": "Raymond Zhu is a junior from Lakeside School. He started competition math in elementary school with the AMC 8, and has since attended MOP in 2025. Outside of math, he enjoys rowing with Lakeside Crew, and has qualified for Nationals with the school's U17 8+ boat."
},
{
    "name": "",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "",
    "title": "",
    "photoURL": "",
    "bio": ""
},
{
    "name": "",
    "title": "",
    "photoURL": "",
    "bio": ""
}
]


